//[],依赖的模块，文件名也就是模块名
require(['a','b'],function(aM,bM){//注意a和a.js路径区别，a相对于data-main,a.js相对于页面
    console.log("依赖的模块加载成功后执行的回调函数")
    aM.aFn();
    bM.bFn();
})
//////////////////////////////////////////////////////////////////////////////////////////////

/*************************************************************
 * 
require.config({
    baseUrl:"aaa",//以aaa为根目录,
    paths:{
        baidu:'www.baidu.com/'//简写路径
    },
    shim:{
        baidu:{
            deps:[],
            init:function(){
                return "我是ng模块"
            }
        }
    }
})

*************************************************************/

//////////////////////////////////////////////////////////////////////////////////////////////